/*************************************************************************
	> File Name: test129.cpp
	> Author: 
	> Mail: 
	> Created Time: 2018年03月07日 星期三 13时14分33秒
 ************************************************************************/

#include <stdio.h>

int main() {
    int x1 = 0, x2 = 2;
    for (int i = 1; i <= 20; i++) {
        printf("x = %d, 2x = %d....", x1 % 4, x2 % 4);
        printf("s = %d, 2s = %d\n", x1, x2);
        if (x1 % 4 == x2 % 4) break;
        x1 += 1, x2 += 2;
    }
    return 0;
}
